
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.1   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

2-user 8-core Stata network perpetual license:
       Serial number:  501406275515
         Licensed to:  Research Data Services
                       University of Pennsylvania

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do "MigrationCalculations.do" MigrationCalculations.log 

. #delimit ;
delimiter now ;
. set memory 30m;
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are
    performed on the fly automatically.

. use DummiesData;

. generate incomeBefore1998Move = .;
(8,984 missing values generated)

. generate incomeDuring1998Move = .;
(8,984 missing values generated)

. generate incomeAfter1998Move = .;
(8,984 missing values generated)

. replace incomeBefore1998Move = 0 if R0490200 == -4;
(5,030 real changes made)

. replace incomeBefore1998Move = R0490200
> if rDifState1998 == 1 & R0490200 >= 0;
(465 real changes made)

. replace incomeBefore1998Move = 0 if R0490200 == -4;
(0 real changes made)

. replace incomeDuring1998Move = R2341200
> if rDifState1998 == 1 & R0490200 >= 0;
(465 real changes made)

. replace incomeBefore1998Move = 0 if R0490200 == -4;
(0 real changes made)

. replace incomeAfter1998Move = R3650200
> if rDifState1998 == 1 & R0490200 >= 0;
(465 real changes made)

. generate incomeBefore1999Move = .;
(8,984 missing values generated)

. generate incomeDuring1999Move = .;
(8,984 missing values generated)

. generate incomeAfter1999Move = .;
(8,984 missing values generated)

. replace incomeBefore1999Move = 0 if R2341200 == -4;
(4,228 real changes made)

. replace incomeBefore1999Move = R2341200
> if rDifState1999 == 1 & R2341200 >= 0;
(547 real changes made)

. replace incomeBefore1999Move = 0 if R3650200 == -4;
(1,281 real changes made)

. replace incomeDuring1999Move = R3650200
> if rDifState1999 == 1 & R3650200 >= 0;
(537 real changes made)

. replace incomeBefore1999Move = 0 if R5098900 == -4;
(516 real changes made)

. replace incomeAfter1999Move = R5098900
> if rDifState1999 == 1 & R5098900 >= 0;
(564 real changes made)

. generate incomeBefore2000Move = .;
(8,984 missing values generated)

. generate incomeDuring2000Move = .;
(8,984 missing values generated)

. generate incomeAfter2000Move = .;
(8,984 missing values generated)

. replace incomeBefore2000Move = 0 if R3650200 == -4;
(3,976 real changes made)

. replace incomeBefore2000Move = R3650200
> if rDifState2000 == 1 & R3650200 >= 0;
(659 real changes made)

. replace incomeBefore2000Move = 0 if R5098900 == -4;
(907 real changes made)

. replace incomeDuring2000Move = R5098900
> if rDifState2000 == 1 & R5098900 >= 0;
(738 real changes made)

. replace incomeBefore2000Move = 0 if R6827500 == -4;
(435 real changes made)

. replace incomeAfter2000Move = R6827500
> if rDifState2000 == 1 & R6827500 >= 0;
(750 real changes made)

. generate incomeBefore2001Move = .;
(8,984 missing values generated)

. generate incomeDuring2001Move = .;
(8,984 missing values generated)

. generate incomeAfter2001Move = .;
(8,984 missing values generated)

. replace incomeBefore2001Move = 0 if R5098900 == -4;
(3,151 real changes made)

. replace incomeBefore2001Move = R5098900
> if rDifState2001 == 1 & R5098900 >= 0;
(841 real changes made)

. replace incomeBefore2001Move = 0 if R6827500 == -4;
(815 real changes made)

. replace incomeDuring2001Move = R6827500
> if rDifState2001 == 1 & R6827500 >= 0;
(1,009 real changes made)

. replace incomeBefore2001Move = 0 if S1055800 == -4;
(447 real changes made)

. replace incomeAfter2001Move = S1055800
> if rDifState2001 == 1 & S1055800 >= 0;
(892 real changes made)

. generate incomeBefore2002Move = .;
(8,984 missing values generated)

. generate incomeDuring2002Move = .;
(8,984 missing values generated)

. generate incomeAfter2002Move = .;
(8,984 missing values generated)

. replace incomeBefore2002Move = 0 if R6827500 == -4;
(2,452 real changes made)

. replace incomeBefore2002Move = R6827500
> if rDifState2002 == 1 & R6827500 >= 0;
(1,076 real changes made)

. replace incomeBefore2002Move = 0 if S1055800 == -4;
(782 real changes made)

. replace incomeDuring2002Move = S1055800
> if rDifState2002 == 1 & S1055800 >= 0;
(1,105 real changes made)

. replace incomeBefore2002Move = 0 if S3134600 == -4;
(496 real changes made)

. replace incomeAfter2002Move = S3134600
> if rDifState2002 == 1 & S3134600 >= 0;
(1,037 real changes made)

. generate incomeBefore2003Move = .;
(8,984 missing values generated)

. generate incomeDuring2003Move = .;
(8,984 missing values generated)

. generate incomeAfter2003Move = .;
(8,984 missing values generated)

. replace incomeBefore2003Move = 0 if S1055800 == -4;
(2,032 real changes made)

. replace incomeBefore2003Move = S1055800
> if rDifState2003 == 1 & S1055800 >= 0;
(1,006 real changes made)

. replace incomeBefore2003Move = 0 if S3134600 == -4;
(750 real changes made)

. replace incomeDuring2003Move = S3134600
> if rDifState2003 == 1 & S3134600 >= 0;
(1,117 real changes made)

. replace incomeBefore2003Move = 0 if S4799600 == -4;
(490 real changes made)

. replace incomeAfter2003Move = S4799600
> if rDifState2003 == 1 & S4799600 >= 0;
(1,031 real changes made)

. generate incomeBefore2004Move = .;
(8,984 missing values generated)

. generate incomeDuring2004Move = .;
(8,984 missing values generated)

. generate incomeAfter2004Move = .;
(8,984 missing values generated)

. replace incomeBefore2004Move = 0 if S3134600 == -4;
(1,754 real changes made)

. replace incomeBefore2004Move = S3134600
> if rDifState2004 == 1 & S3134600 >= 0;
(1,031 real changes made)

. replace incomeBefore2004Move = 0 if S3134600 == -4;
(0 real changes made)

. replace incomeDuring2004Move = S3134600
> if rDifState2004 == 1 & S3134600 >= 0;
(1,031 real changes made)

. replace incomeBefore2004Move = 0 if S6501000 == -4;
(668 real changes made)

. replace incomeAfter2004Move = S6501000
> if rDifState2004 == 1 & S6501000 >= 0;
(1,068 real changes made)

. generate incomeBefore2005Move = .;
(8,984 missing values generated)

. generate incomeDuring2005Move = .;
(8,984 missing values generated)

. generate incomeAfter2005Move = .;
(8,984 missing values generated)

. replace incomeBefore2005Move = 0 if S4799600 == -4;
(1,513 real changes made)

. replace incomeBefore2005Move = S4799600
> if rDifState2005 == 1 & S4799600 >= 0;
(1,011 real changes made)

. replace incomeBefore2005Move = 0 if S6501000 == -4;
(595 real changes made)

. replace incomeDuring2005Move = S6501000
> if rDifState2005 == 1 & S6501000 >= 0;
(1,130 real changes made)

. replace incomeBefore2005Move = 0 if S8496500 == -4;
(373 real changes made)

. replace incomeAfter2005Move = S8496500
> if rDifState2005 == 1 & S8496500 >= 0;
(1,194 real changes made)

. generate incomeBefore2006Move = .;
(8,984 missing values generated)

. generate incomeDuring2006Move = .;
(8,984 missing values generated)

. generate incomeAfter2006Move = .;
(8,984 missing values generated)

. replace incomeBefore2006Move = 0 if S6501000 == -4;
(1,355 real changes made)

. replace incomeBefore2006Move = S6501000
> if rDifState2006 == 1 & S6501000 >= 0;
(1,010 real changes made)

. replace incomeBefore2006Move = 0 if S8496500 == -4;
(507 real changes made)

. replace incomeDuring2006Move = S8496500
> if rDifState2006 == 1 & S8496500 >= 0;
(1,194 real changes made)

. replace incomeBefore2006Move = 0 if T0889800 == -4;
(353 real changes made)

. replace incomeAfter2006Move = T0889800
> if rDifState2006 == 1 & T0889800 >= 0;
(1,197 real changes made)

. generate incomeBefore2007Move = .;
(8,984 missing values generated)

. generate incomeDuring2007Move = .;
(8,984 missing values generated)

. generate incomeAfter2007Move = .;
(8,984 missing values generated)

. replace incomeBefore2007Move = 0 if S8496500 == -4;
(1,173 real changes made)

. replace incomeBefore2007Move = S8496500
> if rDifState2007 == 1 & S8496500 >= 0;
(1,086 real changes made)

. replace incomeBefore2007Move = 0 if T0889800 == -4;
(483 real changes made)

. replace incomeDuring2007Move = T0889800
> if rDifState2007 == 1 & T0889800 >= 0;
(1,169 real changes made)

. replace incomeBefore2007Move = 0 if T3003000 == -4;
(396 real changes made)

. replace incomeAfter2007Move = T3003000
> if rDifState2007 == 1 & T3003000 >= 0;
(1,202 real changes made)

. generate incomeBefore2008Move = .;
(8,984 missing values generated)

. generate incomeDuring2008Move = .;
(8,984 missing values generated)

. generate incomeAfter2008Move = .;
(8,984 missing values generated)

. replace incomeBefore2008Move = 0 if T0889800 == -4;
(1,057 real changes made)

. replace incomeBefore2008Move = T0889800
> if rDifState2008 == 1 & T0889800 >= 0;
(992 real changes made)

. replace incomeBefore2008Move = 0 if T3003000 == -4;
(517 real changes made)

. replace incomeDuring2008Move = T3003000
> if rDifState2008 == 1 & T3003000 >= 0;
(1,158 real changes made)

. replace incomeBefore2008Move = 0 if T4406000 == -4;
(461 real changes made)

. replace incomeAfter2008Move = T4406000
> if rDifState2008 == 1 & T4406000 >= 0;
(1,165 real changes made)

. generate incomeBefore2009Move = .;
(8,984 missing values generated)

. generate incomeDuring2009Move = .;
(8,984 missing values generated)

. generate incomeAfter2009Move = .;
(8,984 missing values generated)

. replace incomeBefore2009Move = 0 if T3003000 == -4;
(1,074 real changes made)

. replace incomeBefore2009Move = T3003000
> if rDifState2009 == 1 & T3003000 >= 0;
(942 real changes made)

. replace incomeBefore2009Move = 0 if T4406000 == -4;
(579 real changes made)

. replace incomeDuring2009Move = T4406000
> if rDifState2009 == 1 & T4406000 >= 0;
(1,071 real changes made)

. replace incomeBefore2009Move = 0 if T6055500 == -4;
(622 real changes made)

. replace incomeAfter2009Move = T6055500
> if rDifState2009 == 1 & T6055500 >= 0;
(935 real changes made)

. generate incomeBefore2010Move = .;
(8,984 missing values generated)

. generate incomeDuring2010Move = .;
(8,984 missing values generated)

. generate incomeAfter2010Move = .;
(8,984 missing values generated)

. replace incomeBefore2010Move = 0 if T4406000 == -4;
(1,189 real changes made)

. replace incomeBefore2010Move = T4406000
> if rDifState2010 == 1 & T4406000 >= 0;
(977 real changes made)

. replace incomeBefore2010Move = 0 if T6055500 == -4;
(753 real changes made)

. replace incomeDuring2010Move = T6055500
> if rDifState2010 == 1 & T6055500 >= 0;
(983 real changes made)

. replace incomeBefore2010Move = 0 if T7545600 == -4;
(432 real changes made)

. replace incomeAfter2010Move = T7545600
> if rDifState2010 == 1 & T7545600 >= 0;
(939 real changes made)

. generate incomeBefore2011Move = .;
(8,984 missing values generated)

. generate incomeDuring2011Move = .;
(8,984 missing values generated)

. generate incomeAfter2011Move = .;
(8,984 missing values generated)

. replace incomeBefore2011Move = 0 if T6055500 == -4;
(1,535 real changes made)

. replace incomeBefore2011Move = T6055500
> if rDifState2011 == 1 & T6055500 >= 0;
(774 real changes made)

. replace incomeBefore2011Move = 0 if T7545600 == -4;
(555 real changes made)

. replace incomeDuring2011Move = T7545600
> if rDifState2011 == 1 & T7545600 >= 0;
(864 real changes made)

. replace incomeBefore2011Move = 0 if T8976700 == -4;
(403 real changes made)

. replace incomeAfter2011Move = T8976700
> if rDifState2011 == 1 & T8976700 >= 0;
(801 real changes made)

. generate incomeBefore2013Move = .;
(8,984 missing values generated)

. generate incomeDuring2013Move = .;
(8,984 missing values generated)

. generate incomeAfter2013Move = .;
(8,984 missing values generated)

. replace incomeBefore2013Move = 0 if T7545600 == -4;
(1,534 real changes made)

. replace incomeBefore2013Move = T7545600
> if rDifState2013 == 1 & T7545600 >= 0;
(1,199 real changes made)

. replace incomeBefore2013Move = 0 if T8976700 == -4;
(522 real changes made)

. replace incomeDuring2013Move = T8976700
> if rDifState2013 == 1 & T8976700 >= 0;
(1,299 real changes made)

. replace incomeBefore2013Move = 0 if U0956900 == -4;
(424 real changes made)

. replace incomeAfter2013Move = U0956900
> if rDifState2013 == 1 & U0956900s >= 0;
U0956900s not found
r(111);

end of do-file
r(111);
